$(function () {
    var pokemonList = [
        "フシギダネ", "フシギソウ", "フシギバナ", "ヒトカゲ",
        "リザード", "リザードン", "ゼニガメ", "カメール",
        "カメックス", "アーボ", "アーボック", "ピカチュウ",
        "ライチュウ", "ライチュウ(アローラ)", "サンド", "サンド(アローラ)",
        "サンドパン", "サンドパン(アローラ)", "ピッピ", "ピクシー",
        "ロコン", "ロコン(アローラ)", "キュウコン", "キュウコン(アローラ)",
        "プリン", "プクリン", "ナゾノクサ", "クサイハナ",
        "ラフレシア", "コンパン", "モルフォン", "ディグダ",
        "ディグダ(アローラ)", "ダグトリオ", "ダグトリオ(アローラ)", "ニャース",
        "ニャース(アローラ)", "ニャース(ガラル)", "ペルシアン", "ペルシアン(アローラ)",
        "コダック", "ゴルダック", "マンキー", "オコリザル",
        "ガーディ", "ガーディ(ヒスイ)", "ウインディ", "ウインディ(ヒスイ)",
        "ニョロモ", "ニョロゾ", "ニョロボン", "マダツボミ",
        "ウツドン", "ウツボット", "メノクラゲ", "ドククラゲ",
        "イシツブテ", "イシツブテ(アローラ)", "ゴローン", "ゴローン(アローラ)",
        "ゴローニャ", "ゴローニャ(アローラ)", "ヤドン", "ヤドン(ガラル)",
        "ヤドラン", "ヤドラン(ガラル)", "コイル", "レアコイル",
        "ドードー", "ドードリオ", "パウワウ", "ジュゴン",
        "ベトベター", "ベトベター(アローラ)", "ベトベトン", "ベトベトン(アローラ)",
        "シェルダー", "パルシェン", "ゴース", "ゴースト",
        "ゲンガー", "スリープ", "スリーパー", "ビリリダマ",
        "ビリリダマ(ヒスイ)", "マルマイン", "マルマイン(ヒスイ)", "タマタマ",
        "ナッシー", "ナッシー(アローラ)", "サワムラー", "エビワラー",
        "ドガース", "マタドガス", "マタドガス(ガラル)", "サイホーン",
        "サイドン", "ラッキー", "タッツー", "シードラ",
        "ストライク", "エレブー", "ブーバー", "ケンタロス",
        "ケンタロス(パルデア単)", "ケンタロス(パルデア炎)", "ケンタロス(パルデア水)", "コイキング",
        "ギャラドス", "ラプラス", "メタモン", "イーブイ",
        "シャワーズ", "サンダース", "ブースター", "ポリゴン",
        "カビゴン", "フリーザー", "フリーザー(ガラル)", "サンダー",
        "サンダー(ガラル)", "ファイヤー", "ファイヤー(ガラル)", "ミニリュウ",
        "ハクリュー", "カイリュー", "ミュウツー", "ミュウ",

        "チコリータ", "ベイリーフ", "メガニウム", "ヒノアラシ",
        "マグマラシ", "バクフーン", "バクフーン(ヒスイ)", "ワニノコ",
        "アリゲイツ", "オーダイル", "オタチ", "オオタチ",
        "ホーホー", "ヨルノズク", "イトマル", "アリアドス",
        "チョンチー", "ランターン", "ピチュー", "ピィ",
        "ププリン", "メリープ", "モココ", "デンリュウ",
        "キレイハナ", "マリル", "マリルリ", "ウソッキー",
        "ニョロトノ", "ハネッコ", "ポポッコ", "ワタッコ",
        "エイパム", "ヒマナッツ", "キマワリ", "ヤンヤンマ",
        "ウパー", "ウパー(パルデア)", "ヌオー", "エーフィ",
        "ブラッキー", "ヤミカラス", "ヤドキング", "ヤドキング(ガラル)",
        "ムウマ", "キリンリキ", "クヌギダマ", "フォレトス",
        "ノコッチ", "グライガー", "ブルー", "グランブル",
        "ハリーセン", "ハリーセン(ヒスイ)", "ハッサム", "ヘラクロス",
        "ニューラ", "ニューラ(ヒスイ)", "ヒメグマ", "リングマ",
        "マグマッグ", "マグカルゴ", "ウリムー", "イノムー",
        "デリバード", "エアームド", "デルビル", "ヘルガー",
        "キングドラ", "ゴマゾウ", "ドンファン", "ポリゴン2",
        "オドシシ", "ドーブル", "バルキー", "カポエラー",
        "エレキッド", "ブビィ", "ハピナス", "ライコウ",
        "エンテイ", "スイクン", "ヨーギラス", "サナギラス",
        "バンギラス", "ルギア", "ホウオウ",

        "キモリ", "ジュプトル", "ジュカイン", "アチャモ",
        "ワカシャモ", "バシャーモ", "ミズゴロウ", "ヌマクロー",
        "ラグラージ", "ポチエナ", "グラエナ", "ハスボー",
        "ハスブレロ", "ルンパッパ", "タネボー", "コノハナ",
        "ダーテング", "キャモメ", "ペリッパー", "ラルトス",
        "キルリア", "サーナイト", "アメタマ", "アメモース",
        "キノココ", "キノガッサ", "ナマケロ", "ヤルキモノ",
        "ケッキング", "マクノシタ", "ハリテヤマ", "ルリリ",
        "ノズパス", "ヤミラミ", "アサナン", "チャーレム",
        "プラスル", "マイナン", "バルビート", "イルミーゼ",
        "ゴクリン", "マルノーム", "ドンメル", "バクーダ",
        "コータス", "バネブー", "ブーピッグ", "ナックラー",
        "ビブラーバ", "フライゴン", "サボネア", "ノクタス",
        "チルット", "チルタリス", "ザングース", "ハブネーク",
        "ドジョッチ", "ナマズン", "ヘイガニ", "シザリガー",
        "ヒンバス", "ミロカロス", "カゲボウズ", "ジュペッタ",
        "ヨマワル", "サマヨール", "トロピウス", "チリーン",
        "ユキワラシ", "オニゴーリ", "ラブカス", "タツベイ",
        "コモルー", "ボーマンダ", "ダンバル", "メタング",
        "メタグロス", "レジロック", "レジアイス", "レジスチル",
        "ラティアス", "ラティオス", "カイオーガ", "グラードン",
        "レックウザ", "ジラーチ", "デオキシス(ノーマル)", "デオキシス(アタック)",
        "デオキシス(ディフェンス)", "デオキシス(スピード)",

        "ナエトル", "ハヤシガメ", "ドダイトス", "ヒコザル",
        "モウカザル", "ゴウカザル", "ポッチャマ", "ポッタイシ",
        "エンペルト", "ムックル", "ムクバード", "ムクホーク",
        "コロボーシ", "コロトック", "コリンク", "ルクシオ",
        "レントラー", "ズガイドス", "ラムパルド", "タテトプス",
        "トリデプス", "ミツハニー", "ビークイン", "パチリス",
        "ブイゼル", "フローゼル",
        "カラナクシ(ピンク)", "カラナクシ(水色)",
        "トリトドン(ピンク)", "トリトドン(水色)",
        "エテボース", "フワンテ", "フワライド", "ムウマージ",
        "ドンカラス", "リーシャン", "スカンプー", "スカタンク",
        "ドーミラー", "ドータクン", "ウソハチ", "ピンプク",
        "ミカルゲ", "フカマル", "ガバイト", "ガブリアス",
        "ゴンベ", "リオル", "ルカリオ", "ヒポポタス",
        "カバルドン", "グレッグル", "ドクロッグ", "ケイコウオ",
        "ネオラント", "ユキカブリ", "ユキノオー", "マニューラ",
        "ジバコイル", "ドサイドン", "エレキブル", "ブーバーン",
        "メガヤンマ", "リーフィア", "グレイシア", "グライオン",
        "マンムー", "ポリゴンZ", "エルレイド", "ダイノーズ",
        "ヨノワール", "ユキメノコ", "ロトム", "ヒートロトム",
        "ウォッシュロトム", "フロストロトム", "スピンロトム", "カットロトム",
        "ユクシー", "エムリット", "アグノム", "ディアルガ",
        "ディアルガ(オリジン)", "パルキア", "パルキア(オリジン)", "ヒードラン",
        "レジギガス", "ギラティナ(アナザー)", "ギラティナ(オリジン)", "クレセリア",
        "フィオネ", "マナフィ", "ダークライ", "シェイミ(ランド)",
        "シェイミ(スカイ)", "アルセウス",

        "ツタージャ", "ジャノビー", "ジャローダ", "ポカブ",
        "チャオブー", "エンブオー", "ミジュマル", "フタチマル",
        "ダイケンキ", "ダイケンキ(ヒスイ)", "シママ", "ゼブライカ",
        "モグリュー", "ドリュウズ", "ドッコラー", "ドテッコツ",
        "ローブシン", "クルミル", "クルマユ", "ハハコモリ",
        "モンメン", "エルフーン", "チュリネ", "ドレディア",
        "ドレディア(ヒスイ)", "バスラオ(赤すじ)", "バスラオ(青すじ)", "バスラオ(白すじ)",
        "メグロコ", "ワルビル", "ワルビアル", "ズルッグ",
        "ズルズキン", "ゾロア", "ゾロア(ヒスイ)", "ゾロアーク",
        "ゾロアーク(ヒスイ)", "チラーミィ", "チラチーノ", "ゴチム",
        "ゴチミル", "ゴチルゼル", "ユニラン", "ダブラン",
        "ランクルス", "コアルヒー", "スワンナ",
        "シキジカ(春)", "シキジカ(夏)", "シキジカ(秋)", "シキジカ(冬)",
        "メブキジカ(春)", "メブキジカ(夏)", "メブキジカ(秋)", "メブキジカ(冬)",
        "タマゲタケ", "モロバレル", "ママンボウ",
        "バチュル", "デンチュラ", "シビシラス", "シビビール",
        "シビルドン", "ヒトモシ", "ランプラー", "シャンデラ",
        "キバゴ", "オノンド", "オノノクス", "クマシュン",
        "ツンベアー", "フリージオ", "コジョフー", "コジョンド",
        "ゴビット", "ゴルーグ", "コマタナ", "キリキザン",
        "ワシボン", "ウォーグル", "ウォーグル(ヒスイ)", "バルチャイ",
        "バルジーナ", "モノズ", "ジヘッド", "サザンドラ",
        "メラルバ", "ウルガモス", "コバルオン", "テラキオン",
        "ビリジオン", "トルネロス(化身)", "トルネロス(霊獣)", "ボルトロス(化身)",
        "ボルトロス(霊獣)", "レシラム", "ゼクロム", "ランドロス(化身)",
        "ランドロス(霊獣)", "キュレム", "ホワイトキュレム", "ブラックキュレム",
        "ケルディオ",

        "ハリマロン", "ハリボーグ", "ブリガロン", "フォッコ",
        "テールナー", "マフォクシー", "ケロマツ", "ゲコガシラ",
        "ゲッコウガ", "ヤヤコマ", "ヒノヤコマ", "ファイアロー",
        "コフキムシ", "コフーライ", "ビビヨン", "シシコ",
        "カエンジシ", "フラベベ", "フラエッテ", "フラージェス",
        "メェークル", "ゴーゴート", "ニャスパー", "ニャオニクス♂",
        "ニャオニクス♀", "マーイーカ", "カラマネロ", "クズモー",
        "ドラミドロ", "ウデッポウ", "ブロスター", "ニンフィア",
        "ルチャブル", "デデンネ", "メレシー", "ヌメラ",
        "ヌメイル", "ヌメイル(ヒスイ)", "ヌメルゴン", "ヌメルゴン(ヒスイ)",
        "クレッフィ", "ボクレー", "オーロット", "カチコール",
        "クレベース", "クレベース(ヒスイ)", "オンバット", "オンバーン",

        "モクロー", "フクスロー", "ジュナイパー", "ジュナイパー(ヒスイ)",
        "ニャビー", "ニャヒート", "ガオガエン", "アシマリ",
        "オシャマリ", "アシレーヌ", "ツツケラ", "ケララッパ",
        "ドデカバシ", "ヤングース", "デカグース", "アゴジムシ",
        "デンヂムシ", "クワガノン", "マケンカニ", "ケケンカニ",
        "オドリドリ(めらめら)", "オドリドリ(ぱちぱち)", "オドリドリ(ふらふら)", "オドリドリ(まいまい)",
        "アブリー", "アブリボン", "イワンコ", "ルガルガン(まひる)",
        "ルガルガン(まよなか)", "ルガルガン(たそがれ)", "ヒドイデ", "ドヒドイデ",
        "ドロバンコ", "バンバドロ", "シズクモ", "オニシズクモ",
        "カリキリ", "ラランテス", "ヤトウモリ", "エンニュート",
        "アマカジ", "アママイコ", "アマージョ", "キュワワー",
        "ヤレユータン", "ナゲツケサル", "スナバァ", "シロデスナ",
        "メテノ", "ネッコアラ", "ミミッキュ",
        "ハギギシリ", "ジャラコ", "ジャランゴ", "ジャラランガ",
        "コスモッグ", "コスモウム", "ソルガレオ", "ルナアーラ",
        "ネクロズマ", "ネクロズマ(日食)", "ネクロズマ(月食)", "マギアナ",

        "サルノリ", "バチンキー", "ゴリランダー", "ヒバニー",
        "ラビフット", "エースバーン", "メッソン", "ジメレオン",
        "インテレオン", "ホシガリス", "ヨクバリス", "ココガラ",
        "アオガラス", "アーマーガア", "カムカメ", "カジリガメ",
        "タンドン", "トロッゴン", "セキタンザン", "カジッチュ",
        "アップリュー", "タルップル", "スナヘビ", "サダイジャ",
        "ウッウ", "サシカマス", "カマスジョー", "エレズン",
        "ストリンダー(ハイ)", "ストリンダー(ロー)", "ヤバチャ", "ポットデス",
        "ミブリム", "テブリム", "ブリムオン", "ベロバー",
        "ギモー", "オーロンゲ", "ニャイキング", "マホミル",
        "マホイップ", "タイレーツ", "バチンウニ", "ユキハミ",
        "モスノウ", "イシヘンジン", "コオリッポ",
        "イエッサン♂", "イエッサン♀", "モルペコ", "ゾウドウ",
        "ダイオウドウ", "ジュラルドン", "ドラメシヤ", "ドロンチ",
        "ドラパルト", "ザシアン", "ザマゼンタ",
        "ムゲンダイナ", "ダクマ", "ウーラオス(悪)",
        "ウーラオス(水)", "レジエレキ", "レジドラゴ",
        "ブリザポス", "レイスポス", "バドレックス", "バドレックス(白)",
        "バドレックス(黒)", "アヤシシ", "バサギリ", "ガチグマ",
        "ガチグマ(アカツキ)", "イダイトウ♂", "イダイトウ♀", "オオニューラ",
        "ハリーマン", "ラブトロス(化身)", "ラブトロス(霊獣)",

        "ニャオハ", "ニャローテ", "マスカーニャ", "ホゲータ",
        "アチゲータ", "ラウドボーン", "クワッス", "ウェルカモ",
        "ウェーニバル", "グルトン", "パフュートン♂", "パフュートン♀",
        "タマンチュラ", "ワナイダー", "マメバッタ", "エクスレッグ",
        "パモ", "パモット", "パーモット", "ワッカネズミ",
        "イッカネズミ(3びき)", "イッカネズミ(4ひき)", "パピモッチ", "バウッツェル",
        "ミニーブ", "オリーニョ", "オリーヴァ", "イキリンコ(グリーン)",
        "イキリンコ(ブルー)", "イキリンコ(イエロー)", "イキリンコ(ホワイト)", "コジオ",
        "ジオヅム", "キョジオーン", "カルボウ", "グレンアルマ",
        "ソウブレイズ", "ズピカ", "ハラバリー", "カイデン",
        "タイカイデン", "オラチフ", "マフィティフ", "シルシュルー",
        "タギングル", "アノクサ", "アノホラグサ", "ノノクラゲ",
        "リククラゲ", "ガケガニ", "カプサイジ", "スコヴィラン",
        "シガロコ", "ベラカス", "ヒラヒナ", "クエスパトラ",
        "カヌチャン", "ナカヌチャン", "デカヌチャン", "ウミディグダ",
        "ウミトリオ", "オトシドリ", "ナミイルカ", "イルカマン",
        "ブロロン", "ブロロローム", "モトトカゲ",
        "ミミズズ", "キラーメ", "キラフロル", "ボチ",
        "ハカドッグ", "カラミンゴ", "アルクジラ", "ハルクジラ",
        "ミガルーサ", "ヘイラッシャ", "シャリタツ(橙色)", "シャリタツ(赤色)",
        "シャリタツ(黄色)", "コノヨザル", "ドオー", "リキキリン",
        "ノココッチ", "ドドゲザン", "イダイナキバ",
        "サケブシッポ", "アラブルタケ", "ハバタクカミ", "チヲハウハネ",
        "スナノケガワ", "テツノワダチ", "テツノツツミ", "テツノカイナ",
        "テツノコウベ", "テツノドクガ", "テツノイバラ", "セビエ",
        "セゴール", "セグレイブ", "コレクレー(はこ)", "コレクレー(とほ)",
        "サーフゴー", "チオンジェン", "パオジアン", "ディンルー",
        "イーユイ", "トドロクツキ", "テツノブジン", "コライドン",
        "ミライドン", "ウネルミナモ", "テツノイサハ", "カミッチュ",
        "チャデス", "ヤバソチャ", "イイネイヌ", "マシマシラ",
        "キチキギス", "オーガポン(みどり)", "オーガポン(いど)", "オーガポン(かまど)",
        "オーガポン(いしずえ)", "ブリジュラス", "カミツオロチ", "ウガツホムラ",
        "タケルライコ", "テツノイワオ", "テツノカシラ", "テラパゴス"
    ];

    var form = {
        'ロトム(ほのお)': 'ヒートロトム',
        'ロトム(みず)': 'ウォッシュロトム',
        'ロトム(こおり)': 'フロストロトム',
        'ロトム(ひこう)': 'スピンロトム',
        'ロトム(くさ)': 'カットロトム',
        'けトルネ': 'トルネロス(化身)',
        'けボルト': 'ボルトロス(化身)',
        'けランド': 'ランドロス(化身)',
        'けラブト': 'ラブトロス(化身)',
        'れトルネ': 'トルネロス(霊獣)',
        'れボルト': 'ボルトロス(霊獣)',
        'れランド': 'ランドロス(霊獣)',
        'れラブト': 'ラブトロス(霊獣)',
        'キュレム(ホワイト)': 'ホワイトキュレム',
        'キュレム(ブラック)': 'ブラックキュレム',
        'いちげき': 'ウーラオス(悪)',
        'れんげき': 'ウーラオス(水)',
        'アカツキ': 'ガチグマ(アカツキ)',
        'みどり': 'オーガポン(みどり)',
        'いど': 'オーガポン(いど)',
        'かまど': 'オーガポン(かまど)',
        'いしずえ': 'オーガポン(いしずえ)'
    };

    function startsWithIgnoreCase(str, term) {
        return ignoreKana(str.toLowerCase()).indexOf(term) === 0;
    }

    function ignoreKana(str) {
        return str.replace(/[\u30a1-\u30f6]/g, function (match) {
            var chr = match.charCodeAt(0) - 0x60;
            return String.fromCharCode(chr);
        });
    }

    $(".pokemon_input").autocomplete({
        source: function (request, response) {
            var term = ignoreKana(request.term.toLowerCase());

            var matchingItems = $.grep(pokemonList.concat(Object.keys(form)), function (item) {
                return startsWithIgnoreCase(item, term);
            });

            matchingItems = matchingItems.map(function (item) {
                return form[item] || item;
            });

            response(matchingItems.slice(0, 4));
        },
        position: { my: "left top-1", at: "left bottom", collision: "none" },
        delay: 100,
        autoFocus: true,
        select: function (event, ui) {
            var currentInput = $(this);
            var itemInput = currentInput.nextAll('input').eq(0);
            var teraInput = currentInput.nextAll('input').eq(1);
            var nextInput = currentInput.closest('.input-group').nextAll('.moves-group').find('input[type="search"]').first();
            var ogerpon = { 'オーガポン(かまど)': 'ほのお', 'オーガポン(いど)': 'みず', 'オーガポン(いしずえ)': 'いわ' };
            var teraConfirm = { 'オーガポン(みどり)': 'くさ', 'テラパゴス': 'ステラ' };
            var itemConfirm = {'ディアルガ(オリジン)':'だいこんごうだま','パルキア(オリジン)':'だいしらたま','ギラティナ(オリジン)':'だいはっきんだま'};
            if (Object.keys(ogerpon).includes(ui.item.value)) {
                itemInput.val(ui.item.value.replace(/^.{6}(.*).{1}$/, "$1") + 'のめん');
                teraInput.val(ogerpon[ui.item.value]);
                nextInput.focus();
            } else if (Object.keys(teraConfirm).includes(ui.item.value)) {
                teraInput.val(teraConfirm[ui.item.value]);
                itemInput.focus();
            } else if (Object.keys(itemConfirm).includes(ui.item.value)) {
                itemInput.val(itemConfirm[ui.item.value]);
                teraInput.focus();
            } else {
                itemInput.focus();
            }
        },
        open: function (event, ui) {
            var autocompleteWidget = $(this).autocomplete("widget");
            var currentWidth = autocompleteWidget.width();
            autocompleteWidget.width(currentWidth + 1);
        }
    });
});
