$(function () {
    var pokemonList = [
        "ヒトカゲ", "リザード", "リザードン", "アーボ",
        "アーボック", "ピカチュウ", "ライチュウ", "ライチュウ(アローラ)",
        "サンド", "サンド(アローラ)", "サンドパン", "サンドパン(アローラ)",
        "ピッピ", "ピクシー", "ロコン", "ロコン(アローラ)",
        "キュウコン", "キュウコン(アローラ)", "プリン", "プクリン",
        "コンパン", "モルフォン", "ディグダ", "ディグダ(アローラ)",
        "ダグトリオ", "ダグトリオ(アローラ)", "ニャース", "ニャース(アローラ)",
        "ニャース(ガラル)", "ペルシアン", "ペルシアン(アローラ)", "コダック",
        "ゴルダック", "マンキー", "オコリザル", "ガーディ",
        "ガーディ(ヒスイ)", "ウインディ", "ウインディ(ヒスイ)", "ニョロモ",
        "ニョロゾ", "ニョロボン", "マダツボミ", "ウツドン",
        "ウツボット", "イシツブテ", "イシツブテ(アローラ)", "ゴローン",
        "ゴローン(アローラ)", "ゴローニャ", "ゴローニャ(アローラ)", "ヤドン",
        "ヤドン(ガラル)", "ヤドラン", "ヤドラン(ガラル)", "コイル",
        "レアコイル", "ベトベター", "ベトベター(アローラ)", "ベトベトン",
        "ベトベトン(アローラ)", "シェルダー", "パルシェン", "ゴース",
        "ゴースト", "ゲンガー", "スリープ", "スリーパー",
        "ビリリダマ", "ビリリダマ(ヒスイ)", "マルマイン", "マルマイン(ヒスイ)",
        "ドガース", "マタドガス", "マタドガス(ガラル)", "ラッキー",
        "ストライク", "ケンタロス", "ケンタロス(パルデア単)", "ケンタロス(パルデア炎)",
        "ケンタロス(パルデア水)", "コイキング", "ギャラドス", "メタモン",
        "イーブイ", "シャワーズ", "サンダース", "ブースター",
        "カビゴン", "フリーザー", "フリーザー(ガラル)", "サンダー",
        "サンダー(ガラル)", "ファイヤー", "ファイヤー(ガラル)", "ミニリュウ",
        "ハクリュー", "カイリュー", "ミュウツー", "ミュウ",
        "ヒノアラシ", "マグマラシ", "バクフーン", "バクフーン(ヒスイ)",
        "オタチ", "オオタチ", "ホーホー", "ヨルノズク",
        "イトマル", "アリアドス", "ピチュー", "ピィ",
        "ププリン", "メリープ", "モココ", "デンリュウ",
        "マリル", "マリルリ", "ウソッキー", "ニョロトノ",
        "ハネッコ", "ポポッコ", "ワタッコ", "エイパム",
        "ヒマナッツ", "キマワリ", "ヤンヤンマ", "ウパー",
        "ウパー(パルデア)", "ヌオー", "エーフィ", "ブラッキー",
        "ヤミカラス", "ヤドキング", "ヤドキング(ガラル)", "ムウマ",
        "キリンリキ", "クヌギダマ", "フォレトス", "ノコッチ",
        "グライガー", "ハリーセン", "ハリーセン(ヒスイ)", "ハッサム",
        "ヘラクロス", "ニューラ", "ニューラ(ヒスイ)", "ヒメグマ",
        "リングマ", "マグマッグ", "マグカルゴ", "ウリムー",
        "イノムー", "デリバード", "デルビル", "ヘルガー",
        "ゴマゾウ", "ドンファン", "オドシシ", "ハピナス",
        "ヨーギラス", "サナギラス", "バンギラス", "ポチエナ",
        "グラエナ", "ハスボー", "ハスブレロ", "ルンパッパ",
        "タネボー", "コノハナ", "ダーテング", "キャモメ",
        "ペリッパー", "ラルトス", "キルリア", "サーナイト",
        "アメタマ", "アメモース", "キノココ", "キノガッサ",
        "ナマケロ", "ヤルキモノ", "ケッキング", "マクノシタ",
        "ハリテヤマ", "ルリリ", "ノズパス", "ヤミラミ",
        "アサナン", "チャーレム", "バルビート", "ゴクリン",
        "マルノーム", "ドンメル", "バクーダ", "コータス",
        "バネブー", "ブーピッグ", "サボネア", "ノクタス",
        "チルット", "チルタリス", "ザングース", "ハブネーク",
        "ドジョッチ", "ナマズン", "ヘイガニ", "シザリガー",
        "ヒンバス", "ミロカロス", "カゲボウズ", "ジュペッタ",
        "ヨマワル", "サマヨール", "トロピウス", "チリーン",
        "ユキワラシ", "オニゴーリ", "ラブカス", "タツベイ",
        "コモルー", "ボーマンダ", "カイオーガ", "グラードン",
        "レックウザ", "ジラーチ", "ナエトル", "ハヤシガメ",
        "ドダイトス", "ヒコザル", "モウカザル", "ゴウカザル",
        "ポッチャマ", "ポッタイシ", "エンペルト", "ムックル",
        "ムクバード", "ムクホーク", "コロボーシ", "コロトック",
        "コリンク", "ルクシオ", "レントラー", "ミツハニー",
        "ビークイン", "パチリス", "ブイゼル", "フローゼル",
        "カラナクシ", "トリトドン", "エテボース", "フワンテ",
        "フワライド", "ムウマージ", "ドンカラス", "リーシャン",
        "スカンプー", "スカタンク", "ドーミラー", "ドータクン",
        "ウソハチ", "ピンプク", "ミカルゲ", "フカマル",
        "ガバイト", "ガブリアス", "ゴンベ", "リオル",
        "ルカリオ", "ヒポポタス", "カバルドン", "グレッグル",
        "ドクロッグ", "ケイコウオ", "ネオラント", "ユキカブリ",
        "ユキノオー", "マニューラ", "ジバコイル", "メガヤンマ",
        "リーフィア", "グレイシア", "グライオン", "マンムー",
        "エルレイド", "ダイノーズ", "ヨノワール", "ユキメノコ",
        "ロトム", "ロトム(みず)", "ロトム(ほのお)", "ロトム(くさ)",
        "ロトム(ひこう)", "ロトム(こおり)", "ユクシー", "エムリット",
        "アグノム", "ディアルガ", "ディアルガ(オリジン)", "パルキア",
        "パルキア(オリジン)", "ヒードラン", "ギラティナ(アナザー)", "ギラティナ(オリジン)",
        "クレセリア", "フィオネ", "マナフィ", "ダークライ",
        "シェイミ(ランド)", "シェイミ(スカイ)", "アルセウス", "ミジュマル",
        "フタチマル", "ダイケンキ", "ダイケンキ(ヒスイ)", "ドッコラー",
        "ドテッコツ", "ローブシン", "クルミル", "クルマユ",
        "ハハコモリ", "チュリネ", "ドレディア", "ドレディア(ヒスイ)",
        "バスラオ", "メグロコ", "ワルビル", "ワルビアル",
        "ゾロア", "ゾロア(ヒスイ)", "ゾロアーク", "ゾロアーク(ヒスイ)",
        "ゴチム", "ゴチミル", "ゴチルゼル", "コアルヒー",
        "スワンナ", "シキジカ", "メブキジカ", "タマゲタケ",
        "モロバレル", "ママンボウ", "シビシラス", "シビビール",
        "シビルドン", "ヒトモシ", "ランプラー", "シャンデラ",
        "キバゴ", "オノンド", "オノノクス", "クマシュン",
        "ツンベアー", "フリージオ", "コジョフー", "コジョンド",
        "コマタナ", "キリキザン", "ワシボン", "ウォーグル",
        "ウォーグル(ヒスイ)", "バルチャイ", "バルジーナ", "モノズ",
        "ジヘッド", "サザンドラ", "メラルバ", "ウルガモス",
        "トルネロス(化身)", "トルネロス(霊獣)", "ボルトロス(化身)", "ボルトロス(霊獣)",
        "ランドロス(化身)", "ランドロス(霊獣)", "メロエッタ(ボイス)", "メロエッタ(ステップ)",
        "ハリマロン", "ハリボーグ", "ブリガロン", "フォッコ",
        "テールナー", "マフォクシー", "ケロマツ", "ゲコガシラ",
        "ゲッコウガ", "ヤヤコマ", "ヒノヤコマ", "ファイアロー",
        "コフキムシ", "コフーライ", "ビビヨン", "シシコ",
        "カエンジシ", "フラベベ", "フラエッテ", "フラージェス",
        "メェークル", "ゴーゴート", "クズモー", "ドラミドロ",
        "ウデッポウ", "ブロスター", "ニンフィア", "ルチャブル",
        "デデンネ", "メレシー", "ヌメラ", "ヌメイル",
        "ヌメイル(ヒスイ)", "ヌメルゴン", "ヌメルゴン(ヒスイ)", "クレッフィ",
        "ボクレー", "オーロット", "カチコール", "クレベース",
        "クレベース(ヒスイ)", "オンバット", "オンバーン", "ディアンシー",
        "フーパ(いましめ)", "フーパ(ときはな)", "ボルケニオン", "モクロー",
        "フクスロー", "ジュナイパー", "ジュナイパー(ヒスイ)", "ヤングース",
        "デカグース", "アゴジムシ", "デンヂムシ", "クワガノン",
        "マケンカニ", "ケケンカニ", "オドリドリ(めらめら)", "オドリドリ(ぱちぱち)",
        "オドリドリ(ふらふら)", "オドリドリ(まいまい)", "アブリー", "アブリボン",
        "イワンコ", "ルガルガン(まひる)", "ルガルガン(まよなか)", "ルガルガン(たそがれ)",
        "ヒドイデ", "ドヒドイデ", "ドロバンコ", "バンバドロ", "カリキリ",
        "ラランテス", "ヤトウモリ", "エンニュート", "アマカジ",
        "アママイコ", "アマージョ", "ヤレユータン", "ナゲツケサル",
        "スナバァ", "シロデスナ", "ネッコアラ", "ミミッキュ",
        "ハギギシリ", "ジャラコ", "ジャランゴ", "ジャラランガ",
        "マギアナ", "サルノリ", "バチンキー", "ゴリランダー",
        "ヒバニー", "ラビフット", "エースバーン", "メッソン",
        "ジメレオン", "インテレオン", "ホシガリス", "ヨクバリス",
        "ココガラ", "アオガラス", "アーマーガア", "カムカメ",
        "カジリガメ", "タンドン", "トロッゴン", "セキタンザン",
        "カジッチュ", "アップリュー", "タルップル", "スナヘビ",
        "サダイジャ", "ウッウ", "サシカマス", "カマスジョー",
        "エレズン", "ストリンダー", "ヤバチャ",
        "ポットデス", "ミブリム", "テブリム", "ブリムオン",
        "ベロバー", "ギモー", "オーロンゲ", "ニャイキング",
        "タイレーツ", "バチンウニ", "ユキハミ", "モスノウ",
        "イシヘンジン", "コオリッポ", "イエッサン♂", "イエッサン♀",
        "モルペコ", "ゾウドウ", "ダイオウドウ", "ドラメシヤ",
        "ドロンチ", "ドラパルト", "ダクマ",
        "ウーラオス(いちげき)", "ウーラオス(れんげき)", "ザルード", "レジエレキ",
        "レジドラゴ", "ブリザポス", "レイスポス",
        "アヤシシ", "バサギリ",
        "ガチグマ", "ガチグマ(アカツキ)", "イダイトウ♂", "イダイトウ♀",
        "オオニューラ", "ハリーマン", "ラブトロス(化身)", "ラブトロス(霊獣)",
        "ニャオハ", "ニャローテ", "マスカーニャ", "ホゲータ",
        "アチゲータ", "ラウドボーン", "クワッス", "ウェルカモ",
        "ウェーニバル", "グルトン", "パフュートン♂", "パフュートン♀",
        "タマンチュラ", "ワナイダー", "マメバッタ", "エクスレッグ",
        "パモ", "パモット", "パーモット", "ワッカネズミ",
        "イッカネズミ", "パピモッチ", "バウッツェル", "ミニーブ",
        "オリーニョ", "オリーヴァ", "イキリンコ", "コジオ",
        "ジオヅム", "キョジオーン", "カルボウ", "グレンアルマ",
        "ソウブレイズ", "ズピカ", "ハラバリー", "カイデン",
        "タイカイデン", "オラチフ", "マフィティフ", "シルシュルー",
        "タギングル", "アノクサ", "アノホラグサ", "ノノクラゲ",
        "リククラゲ", "ガケガニ", "カプサイジ", "スコヴィラン",
        "シガロコ", "ベラカス", "ヒラヒナ", "クエスパトラ",
        "カヌチャン", "ナカヌチャン", "デカヌチャン", "ウミディグダ",
        "ウミトリオ", "オトシドリ", "ナミイルカ", "イルカマン",
        "ブロロン", "ブロロローム", "モトトカゲ", "ミミズズ",
        "キラーメ", "キラフロル", "ボチ", "ハカドッグ",
        "カラミンゴ", "アルクジラ", "ハルクジラ", "ミガルーサ",
        "ヘイラッシャ", "コノヨザル", "ドオー", "リキキリン",
        "ノココッチ", "ドドゲザン", "イダイナキバ", "サケブシッポ",
        "アラブルタケ", "ハバタクカミ", "チヲハウハネ", "スナノケガワ",
        "テツノワダチ", "テツノツツミ", "テツノカイナ", "テツノコウベ",
        "テツノドクガ", "テツノイバラ", "セビエ", "セゴール",
        "セグレイブ", "コレクレー(はこ)", "コレクレー(とほ)", "サーフゴー",
        "チオンジェン", "パオジアン", "ディンルー", "イーユイ",
        "トドロクツキ", "テツノブジン", "コライドン", "ミライドン",
        "ウネルミナモ", "テツノイサハ", "カミッチュ", "チャデス",
        "ヤバソチャ", "イイネイヌ", "マシマシラ", "キチキギス",
        "オーガポン(みどり)", "オーガポン(いど)", "オーガポン(かまど)", "オーガポン(いしずえ)",
        "シャリタツ",
        "フシギダネ", "フシギソウ", "フシギバナ", "ゼニガメ",
        "カメール", "カメックス", "ナゾノクサ", "クサイハナ",
        "ラフレシア", "メノクラゲ", "ドククラゲ", "ドードー",
        "ドードリオ", "パウワウ", "ジュゴン", "タマタマ",
        "ナッシー", "ナッシー(アローラ)", "サワムラー", "エビワラー",
        "サイホーン", "サイドン", "タッツー", "シードラ",
        "エレブー", "ブーバー", "ラプラス", "ポリゴン",
        "チコリータ", "ベイリーフ", "メガニウム", "ワニノコ",
        "アリゲイツ", "オーダイル", "チョンチー", "ランターン",
        "キレイハナ", "ブルー", "グランブル", "エアームド",
        "キングドラ", "ポリゴン2", "ドーブル", "バルキー",
        "カポエラー", "エレキッド", "ブビィ", "ライコウ",
        "エンテイ", "スイクン", "キモリ", "ジュプトル",
        "ジュカイン", "アチャモ", "ワカシャモ", "バシャーモ",
        "ミズゴロウ", "ヌマクロー", "ラグラージ", "プラスル",
        "マイナン", "ナックラー", "ビブラーバ", "フライゴン",
        "ダンバル", "メタング", "メタグロス", "レジロック",
        "レジアイス", "レジスチル", "ラティアス", "ラティオス",
        "ズガイドス", "ラムパルド", "タテトプス", "トリデプス",
        "ドサイドン", "エレキブル", "ブーバーン", "ポリゴンZ",
        "レジギガス", "ツタージャ", "ジャノビー", "ジャローダ",
        "ポカブ", "チャオブー", "エンブオー", "シママ",
        "ゼブライカ", "モグリュー", "ドリュウズ", "モンメン",
        "エルフーン", "ズルッグ", "ズルズキン", "チラーミィ",
        "チラチーノ", "ユニラン", "ダブラン", "ランクルス",
        "バチュル", "デンチュラ", "ゴビット", "ゴルーグ",
        "コバルオン", "テラキオン", "ビリジオン", "ニャスパー",
        "ニャオニクス♂", "ニャオニクス♀", "マーイーカ", "カラマネロ",
        "ニャビー", "ニャヒート", "ガオガエン", "アシマリ",
        "オシャマリ", "アシレーヌ", "ツツケラ", "ケララッパ",
        "ドデカバシ", "シズクモ", "オニシズクモ", "キュワワー",
        "メテノ", "マホミル", "マホイップ", "ジュラルドン",
        "ブリジュラス", "カミツオロチ", "ウガツホムラ", "タケルライコ",
        "テツノイワオ", "テツノカシラ"
    ];

    var form = {
        'ヒートロトム': 'ロトム(ほのお)',
        'ウォッシュロトム': 'ロトム(みず)',
        'フロストロトム': 'ロトム(こおり)',
        'スピンロトム': 'ロトム(ひこう)',
        'カットロトム': 'ロトム(くさ)'
    };

    // ひらがなとカタカナを区別せずに前方一致検索するための関数
    function startsWithIgnoreCase(str, term) {
        return ignoreKana(str.toLowerCase()).indexOf(term) === 0;
    }

    // ひらがなとカタカナを区別せずに検索するための関数
    function ignoreKana(str) {
        return str.replace(/[\u30a1-\u30f6]/g, function (match) {
            var chr = match.charCodeAt(0) - 0x60;
            return String.fromCharCode(chr);
        });
    }

    // Autocompleteを適用
    $(".pokemon_input").autocomplete({
        source: function (request, response) {
            var term = ignoreKana(request.term.toLowerCase()); // 入力された値をひらがなとカタカナを区別せずに小文字に変換

            // pokemonListとformから入力に前方一致する項目を検索
            var matchingItems = $.grep(pokemonList.concat(Object.keys(form)), function (item) {
                return startsWithIgnoreCase(item, term);
            });

            // formのエイリアスを元の名前に変換
            matchingItems = matchingItems.map(function (item) {
                return form[item] || item;
            });

            // 最大4つまでの候補を表示
            response(matchingItems.slice(0, 4));
        },
        delay: 100,
        autoFocus: true,
        select: function (event, ui) {
            // 選択されたときの処理
            var currentInput = $(this);
            var nextInput = currentInput.nextAll('input:first'); // 次のinput要素を取得

            if (nextInput.length > 0) {
                nextInput.focus();
            }
        }
    });
});

/*候補のフォントサイズを変更
.ui-autocomplete {
    font-size: 14px;
}*/